## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.zerossl-eab-hmac-key must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key" {
!       id                             = "kube-system/zerossl-hmac-key" -> (known after apply)
-       immutable                      = false -> null
        # (3 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
!           name             = "zerossl-hmac-key" -> "zerossl-eab-hmac-key" # forces replacement
!           resource_version = "1088303" -> (known after apply)
!           uid              = "0b197248-c5a1-4f56-8de0-825ff6ae912f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key-id" {
!       id                             = "kube-system/zerossl-hmac-key-id" -> (known after apply)
-       immutable                      = false -> null
        # (3 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
!           name             = "zerossl-hmac-key-id" -> "zerossl-eab-hmac-key-id" # forces replacement
!           resource_version = "1088304" -> (known after apply)
!           uid              = "d4fbd9c8-4efe-4645-a6e0-46cfd66a086b" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
